[Killed] BlockStatement
gradeCalculator.js:1:32
-function calculateGrade(score) {
-if (score < 0 || score > 100) {
-return 'Invalid Score';
-}
-if (score >= 90) {
-return 'A';
-}
-if (score >= 80) {
-return 'B';
-}
-if (score >= 70) {
-return 'C';
-}
-if (score >= 60) {
-return 'D';
-}
-return 'E';
-}
+function calculateGrade(score) {}
 module.exports = calculateGrade;
killedBy: calculateGrade should return A for a high score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: undefined

[Killed] BlockStatement
gradeCalculator.js:2:31
 function calculateGrade(score) {
-if (score < 0 || score > 100) {
-return 'Invalid Score';
-}
+if (score < 0 || score > 100) {}
 if (score >= 90) {
 return 'A';
killedBy: calculateGrade should handle invalid negative scores
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid Score"
Received: "E"

[Killed] ConditionalExpression
gradeCalculator.js:2:5
 function calculateGrade(score) {
-if (score < 0 || score > 100) {
+if (false || score > 100) {
 return 'Invalid Score';
 }
killedBy: calculateGrade should handle invalid negative scores
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid Score"
Received: "E"

[Killed] EqualityOperator
gradeCalculator.js:5:5
 if (score < 0 || score > 100) {
 return 'Invalid Score';
 }
-if (score >= 90) {
+if (score < 90) {
 return 'A';
 }
killedBy: calculateGrade should return A for a high score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "B"

[Killed] BlockStatement
gradeCalculator.js:5:18
 if (score < 0 || score > 100) {
 return 'Invalid Score';
 }
-if (score >= 90) {
-return 'A';
-}
+if (score >= 90) {}
 if (score >= 80) {
 return 'B';
killedBy: calculateGrade should return A for a high score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "B"

[Killed] StringLiteral
gradeCalculator.js:6:8
 return 'Invalid Score';
 }
 if (score >= 90) {
-return 'A';
+return "";
 }
 if (score >= 80) {
killedBy: calculateGrade should return A for a high score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: ""

[Killed] BlockStatement
gradeCalculator.js:8:18
 if (score >= 90) {
 return 'A';
 }
-if (score >= 80) {
-return 'B';
-}
+if (score >= 80) {}
 if (score >= 70) {
 return 'C';
killedBy: calculateGrade should return B for a good score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "C"

[Killed] ConditionalExpression
gradeCalculator.js:8:5
 if (score >= 90) {
 return 'A';
 }
-if (score >= 80) {
+if (false) {
 return 'B';
 }
killedBy: calculateGrade should return B for a good score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "C"

[Killed] StringLiteral
gradeCalculator.js:9:8
 return 'A';
 }
 if (score >= 80) {
-return 'B';
+return "";
 }
 if (score >= 70) {
killedBy: calculateGrade should return B for a good score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: ""

[Killed] EqualityOperator
gradeCalculator.js:11:5
 if (score >= 80) {
 return 'B';
 }
-if (score >= 70) {
+if (score < 70) {
 return 'C';
 }
killedBy: calculateGrade should return C for an average score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: "D"

[Killed] BlockStatement
gradeCalculator.js:11:18
 if (score >= 80) {
 return 'B';
 }
-if (score >= 70) {
-return 'C';
-}
+if (score >= 70) {}
 if (score >= 60) {
 return 'D';
killedBy: calculateGrade should return C for an average score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: "D"

[Killed] ConditionalExpression
gradeCalculator.js:14:5
 if (score >= 70) {
 return 'C';
 }
-if (score >= 60) {
+if (true) {
 return 'D';
 }
killedBy: calculateGrade should return E for a low score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "E"
Received: "D"

[Killed] EqualityOperator
gradeCalculator.js:14:5
 if (score >= 70) {
 return 'C';
 }
-if (score >= 60) {
+if (score < 60) {
 return 'D';
 }
killedBy: calculateGrade should return E for a low score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "E"
Received: "D"

[NoCoverage] StringLiteral
gradeCalculator.js:15:8
 return 'C';
 }
 if (score >= 60) {
-return 'D';
+return "";
 }
 return 'E';

[Killed] StringLiteral
gradeCalculator.js:17:8
 if (score >= 60) {
 return 'D';
 }
-return 'E';
+return "";
 }
 module.exports = calculateGrade;
killedBy: calculateGrade should return E for a low score
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "E"
Received: ""
